testCase/cavity_velocity_initial_condition/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (1 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (64 64 1) simpleGrading (1 1 1)
);

edges
(
); 

	boundary
	(
		left                       
		{
		    type               cyclic;
		    neighbourPatch     right;
		    faces              ((0 4 7 3));

		}
		

    right
    {
        type               cyclic;
        neighbourPatch     left;
        faces              ((5 6 1 2));
    }

  top                       
    {
        type               cyclic;
        neighbourPatch     bottom;
        faces              ((3 7 6 2));
       


    }
    

    bottom
    {
        type               cyclic;
        neighbourPatch     top;
        faces              ((1 5 4 0));
    }

 


    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
