testCase/cavity_velocity_initial_condition/constant/cloud_of_points
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    location    "constant";
    object      cloud_of_points;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


1416
(
(0.75 0.5 0)
(0.25 0.5 0)
(0.8125 0.5 0)
(0.1875 0.5 0)
(0.5 0.75 0)
(0.5 0.25 0)
(0.5 0.8125 0)
(0.5 0.1875 0)
(0.812389 0.508319 0)
(0.812057 0.516632 0)
(0.811504 0.524933 0)
(0.81073 0.533217 0)
(0.809735 0.541477 0)
(0.808521 0.549707 0)
(0.807089 0.557903 0)
(0.805439 0.566057 0)
(0.803572 0.574165 0)
(0.80149 0.58222 0)
(0.799194 0.590216 0)
(0.796687 0.598149 0)
(0.793969 0.606012 0)
(0.791043 0.6138 0)
(0.78791 0.621508 0)
(0.784573 0.629129 0)
(0.781035 0.636659 0)
(0.777298 0.644091 0)
(0.773363 0.651422 0)
(0.769236 0.658646 0)
(0.764917 0.665757 0)
(0.760411 0.67275 0)
(0.75572 0.679621 0)
(0.750847 0.686365 0)
(0.745797 0.692976 0)
(0.740573 0.699451 0)
(0.735178 0.705785 0)
(0.729617 0.711972 0)
(0.723893 0.71801 0)
(0.71801 0.723893 0)
(0.711972 0.729617 0)
(0.705785 0.735178 0)
(0.699451 0.740573 0)
(0.692976 0.745797 0)
(0.686365 0.750847 0)
(0.679621 0.75572 0)
(0.67275 0.760411 0)
(0.665757 0.764917 0)
(0.658646 0.769236 0)
(0.651422 0.773363 0)
(0.644091 0.777298 0)
(0.636659 0.781035 0)
(0.629129 0.784573 0)
(0.621508 0.78791 0)
(0.6138 0.791043 0)
(0.606012 0.793969 0)
(0.598149 0.796687 0)
(0.590216 0.799194 0)
(0.58222 0.80149 0)
(0.574165 0.803572 0)
(0.566057 0.805439 0)
(0.557903 0.807089 0)
(0.549707 0.808521 0)
(0.541477 0.809735 0)
(0.533217 0.81073 0)
(0.524933 0.811504 0)
(0.516632 0.812057 0)
(0.508319 0.812389 0)
(0.491681 0.812389 0)
(0.483368 0.812057 0)
(0.475067 0.811504 0)
(0.466783 0.81073 0)
(0.458523 0.809735 0)
(0.450293 0.808521 0)
(0.442097 0.807089 0)
(0.433943 0.805439 0)
(0.425835 0.803572 0)
(0.41778 0.80149 0)
(0.409784 0.799194 0)
(0.401851 0.796687 0)
(0.393988 0.793969 0)
(0.3862 0.791043 0)
(0.378492 0.78791 0)
(0.370871 0.784573 0)
(0.363341 0.781035 0)
(0.355909 0.777298 0)
(0.348578 0.773363 0)
(0.341354 0.769236 0)
(0.334243 0.764917 0)
(0.32725 0.760411 0)
(0.320379 0.75572 0)
(0.313635 0.750847 0)
(0.307024 0.745797 0)
(0.300549 0.740573 0)
(0.294215 0.735178 0)
(0.288028 0.729617 0)
(0.28199 0.723893 0)
(0.276107 0.71801 0)
(0.270383 0.711972 0)
(0.264822 0.705785 0)
...
)


// ************************************************************************* //
