testCase/cavity_velocity_initial_condition/constant/connectivity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelListList;
    location    "constant";
    object      connectivity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


2360
(
3(6 66 472)
3(472 66 488)
3(472 488 473)
3(473 488 489)
3(473 489 474)
3(474 489 490)
3(474 490 475)
3(475 490 491)
3(475 491 4)
3(4 491 298)
3(66 67 488)
3(488 67 492)
3(488 492 489)
3(489 492 493)
3(489 493 490)
3(490 493 494)
3(490 494 491)
3(491 494 495)
3(491 495 298)
3(298 495 299)
3(67 68 492)
3(492 68 496)
3(492 496 493)
3(493 496 497)
3(493 497 494)
3(494 497 498)
3(494 498 495)
3(495 498 499)
3(495 499 299)
3(299 499 300)
3(68 69 496)
3(496 69 500)
3(496 500 497)
3(497 500 501)
3(497 501 498)
3(498 501 502)
3(498 502 499)
3(499 502 503)
3(499 503 300)
3(300 503 301)
3(69 70 500)
3(500 70 504)
3(500 504 501)
3(501 504 505)
3(501 505 502)
3(502 505 506)
3(502 506 503)
3(503 506 507)
3(503 507 301)
3(301 507 302)
3(70 71 504)
3(504 71 508)
3(504 508 505)
3(505 508 509)
3(505 509 506)
3(506 509 510)
3(506 510 507)
3(507 510 511)
3(507 511 302)
3(302 511 303)
3(71 72 508)
3(508 72 512)
3(508 512 509)
3(509 512 513)
3(509 513 510)
3(510 513 514)
3(510 514 511)
3(511 514 515)
3(511 515 303)
3(303 515 304)
3(72 73 512)
3(512 73 516)
3(512 516 513)
3(513 516 517)
3(513 517 514)
3(514 517 518)
3(514 518 515)
3(515 518 519)
3(515 519 304)
3(304 519 305)
3(73 74 516)
3(516 74 520)
3(516 520 517)
3(517 520 521)
3(517 521 518)
3(518 521 522)
3(518 522 519)
3(519 522 523)
3(519 523 305)
3(305 523 306)
3(74 75 520)
3(520 75 524)
3(520 524 521)
3(521 524 525)
3(521 525 522)
3(522 525 526)
3(522 526 523)
3(523 526 527)
...
)


// ************************************************************************* //
