testCase/cavity_velocity_initial_condition/0/currentcloudofpoints
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      currentcloudofpoints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
1416(
 (	0.75		0.5		0	)
(	0.25		0.5		0	)
(	0.8125		0.5		0	)
(	0.1875		0.5		0	)
(	0.5		0.75		0	)
(	0.5		0.25		0	)
(	0.5		0.8125		0	)
(	0.5		0.1875		0	)
(	0.8123892535		0.5083189129		0	)
(	0.8120570924		0.5166319296		0	)
(	0.8115037522		0.524933158		0	)
(	0.8107296251		0.5332167143		0	)
(	0.8097352597		0.5414767273		0	)
(	0.8085213609		0.5497073425		0	)
(	0.8070887889		0.5579027263		0	)
(	0.8054385593		0.5660570699		0	)
(	0.8035718416		0.5741645937		0	)
(	0.801489959		0.5822195513		0	)
(	0.799194387		0.5902162335		0	)
(	0.7966867526		0.5981489725		0	)
(	0.7939688333		0.6060121457		0	)
(	0.7910425555		0.6138001798		0	)
(	0.7879099931		0.6215075548		0	)
(	0.7845733665		0.6291288081		0	)
(	0.7810350407		0.6366585376		0	)
(	0.7772975235		0.6440914067		0	)
(	0.7733634639		0.651422147		0	)
(	0.7692356504		0.6586455626		0	)
(	0.7649170087		0.6657565338		0	)
(	0.7604105997		0.6727500204		0	)
(	0.7557196175		0.6796210657		0	)
(	0.7508473869		0.6863647995		0	)
(	0.7457973612		0.6929764422		0	)
(	0.7405731198		0.6994513074		0	)
(	0.7351783656		0.705784806		0	)
(	0.7296169221		0.7119724488		0	)
(	0.7238927313		0.7180098504		0	)
(	0.7180098504		0.7238927313		0	)
(	0.7119724488		0.7296169221		0	)
(	0.705784806		0.7351783656		0	)
(	0.6994513074		0.7405731198		0	)
(	0.6929764422		0.7457973612		0	)
(	0.6863647995		0.7508473869		0	)
(	0.6796210657		0.7557196175		0	)
(	0.6727500204		0.7604105997		0	)
(	0.6657565338		0.7649170087		0	)
(	0.6586455626		0.7692356504		0	)
(	0.651422147		0.7733634639		0	)
(	0.6440914067		0.7772975235		0	)
(	0.6366585376		0.7810350407		0	)
(	0.6291288081		0.7845733665		0	)
(	0.6215075548		0.7879099931		0	)
(	0.6138001798		0.7910425555		0	)
(	0.6060121457		0.7939688333		0	)
(	0.5981489725		0.7966867526		0	)
(	0.5902162335		0.799194387		0	)
(	0.5822195513		0.801489959		0	)
(	0.5741645937		0.8035718416		0	)
(	0.5660570699		0.8054385593		0	)
(	0.5579027263		0.8070887889		0	)
(	0.5497073425		0.8085213609		0	)
(	0.5414767273		0.8097352597		0	)
(	0.5332167143		0.8107296251		0	)
(	0.524933158		0.8115037522		0	)
(	0.5166319296		0.8120570924		0	)
(	0.5083189129		0.8123892535		0	)
(	0.4916810871		0.8123892535		0	)
(	0.4833680704		0.8120570924		0	)
(	0.475066842		0.8115037522		0	)
(	0.4667832857		0.8107296251		0	)
(	0.4585232727		0.8097352597		0	)
(	0.4502926575		0.8085213609		0	)
(	0.4420972737		0.8070887889		0	)
(	0.4339429301		0.8054385593		0	)
(	0.4258354063		0.8035718416		0	)
(	0.4177804487		0.801489959		0	)
(	0.4097837665		0.799194387		0	)
(	0.4018510275		0.7966867526		0	)
(	0.3939878543		0.7939688333		0	)
(	0.3861998202		0.7910425555		0	)
(	0.3784924452		0.7879099931		0	)
(	0.3708711919		0.7845733665		0	)
(	0.3633414624		0.7810350407		0	)
(	0.3559085933		0.7772975235		0	)
(	0.348577853		0.7733634639		0	)
(	0.3413544374		0.7692356504		0	)
(	0.3342434662		0.7649170087		0	)
(	0.3272499796		0.7604105997		0	)
(	0.3203789343		0.7557196175		0	)
(	0.3136352005		0.7508473869		0	)
(	0.3070235578		0.7457973612		0	)
(	0.3005486926		0.7405731198		0	)
(	0.294215194		0.7351783656		0	)
(	0.2880275512		0.7296169221		0	)
(	0.2819901496		0.7238927313		0	)
(	0.2761072687		0.7180098504		0	)
(	0.2703830779		0.7119724488		0	)
(	0.2648216344		0.705784806		0	)
(	0.2594268802		0.6994513074		0	)
...
(	0.5079861564		0.7998936833		0	)



)
// ************************************************************************* //
